Ran Plan for dir: `non-prod/stage/eu-west-1` workspace: `default`

<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/04/12 21:14:27 Setting download directory for module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1 to /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/.terragrunt-cache
[terragrunt] 2020/04/12 21:14:27 Module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1 does not have an associated terraform configuration and will be skipped.
[terragrunt] 2020/04/12 21:14:27 Setting download directory for module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3 to /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3/.terragrunt-cache
[terragrunt] 2020/04/12 21:14:27 Stack at /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1:
  => Module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3 (excluded: false, dependencies: [])
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3] 2020/04/12 21:14:27 Module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3 must wait for 0 dependencies to finish
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3] 2020/04/12 21:14:27 Running module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3 now
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3] 2020/04/12 21:14:27 Reading Terragrunt config file at /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3/terragrunt.hcl
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3] 2020/04/12 21:14:28 Assuming IAM role arn:aws:iam::446381716460:role/982489228146-cross-account-administrator-access
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3] 2020/04/12 21:14:28 WARNING: no double-slash (//) found in source URL /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/_modules/s3. Relative paths in downloaded Terraform code may not work.
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3] 2020/04/12 21:14:28 Downloading Terraform configurations from file:///home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/_modules/s3 into /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3/.terragrunt-cache/qyacVcPFCAMlkzdvz6jx5iJ937Y/9ELQFFxZy2hn1g71Vx3ZLgSMt04
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3] 2020/04/12 21:14:28 Copying files from /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3 into /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3/.terragrunt-cache/qyacVcPFCAMlkzdvz6jx5iJ937Y/9ELQFFxZy2hn1g71Vx3ZLgSMt04
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3] 2020/04/12 21:14:28 Setting working directory to /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3/.terragrunt-cache/qyacVcPFCAMlkzdvz6jx5iJ937Y/9ELQFFxZy2hn1g71Vx3ZLgSMt04
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3] 2020/04/12 21:14:28 Running command: terraform plan -no-color -out /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/default.tfplan
var.role_arn
  Enter a value: 
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_caller_identity.current: Refreshing state...
aws_s3_bucket.this: Refreshing state... [id=446381716460-stage-new-bucket]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.this must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
        acl                         = "private"
      ~ arn                         = "arn:aws:s3:::446381716460-stage-new-bucket" -> (known after apply)
      ~ bucket                      = "446381716460-stage-new-bucket" -> "446381716460-stage-my-bucket" # forces replacement
      ~ bucket_domain_name          = "446381716460-stage-new-bucket.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "446381716460-stage-new-bucket.s3.eu-west-1.amazonaws.com" -> (known after apply)
        force_destroy               = false
      ~ hosted_zone_id              = "Z1BKCTXD74EZPE" -> (known after apply)
      ~ id                          = "446381716460-stage-new-bucket" -> (known after apply)
      ~ region                      = "eu-west-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
            "Environment" = "stage"
          ~ "Name"        = "new-bucket" -> "my-bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/default.tfplan"

[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3] 2020/04/12 21:14:35 Module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3 has finished successfully!
[terragrunt] 2020/04/12 21:14:35 Error with plan: [terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/53/default/non-prod/stage/eu-west-1/s3] 2020/04/12 21:14:28 Running command: terraform --version

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d non-prod/stage/eu-west-1`
* :put_litter_in_its_place: To **delete** this plan click [here](https://stage-atlantis.adventiel.io/lock?id=gwendallg%252Fatlantis-test%252Fnon-prod%252Fstage%252Feu-west-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d non-prod/stage/eu-west-1`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
